In [2]:
import numpy as np
import pandas as pd

In [4]:
 s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
 s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
 s3 = pd.Series(np.random.randint(10000, high=30001, size=100,dtype='l'))

 print(s1, s2, s3)

0     4
1     3
2     4
3     4
4     1
     ..
95    3
96    3
97    3
98    1
99    1
Length: 100, dtype: int32 0     1
1     1
2     2
3     2
4     2
     ..
95    1
96    3
97    3
98    2
99    1
Length: 100, dtype: int32 0     19220
1     21258
2     26957
3     16567
4     23021
      ...
95    23460
96    21854
97    24891
98    25636
99    19124
Length: 100, dtype: int32

In [8]:
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  4  1  19220
1  3  1  21258
2  4  2  26957
3  4  2  16567
4  1  2  23021

In [9]:
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      4       1            19220
1      3       1            21258
2      4       2            26957
3      4       2            16567
4      1       2            23021

In [11]:
# join concat the values
bigcolumn = pd.concat([s1, s2, s3], axis=0)

In [12]:
# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()

In [13]:
print(type(bigcolumn))

<class 'pandas.core.frame.DataFrame'>

In [14]:
bigcolumn

        0
0       4
1       3
2       4
3       4
4       1
..    ...
95  23460
96  21854
97  24891
98  25636
99  19124

[300 rows x 1 columns]

In [15]:
len(bigcolumn)

300

In [16]:
 bigcolumn.reset_index(drop=True, inplace=True)
 bigcolumn

         0
0        4
1        3
2        4
3        4
4        1
..     ...
295  23460
296  21854
297  24891
298  25636
299  19124

[300 rows x 1 columns]